{
  "main": {
    "title": "works.",
    "paragraph": [
      "These are the projects that I have worked or are currently working on.",
      "I have always tried to experiment with as many technologies as possible. I truly believe that in order to become a better coder/designer/creator one has to try a little bit of everything and continue to learn.", "So you will be able to find in my projects a range from mobile apps, web apps, iot integrations, game apps, to generative art.",
      "",
      "The projects marked with a * represent my most creative projects. The ones that I really took the time to think beyond the code, and tried to give the users a meaningful experience.",
      "The projects marked with ** represent my most technical projects. The ones that I really focused on getting the architecture and and execution perfect.",
      "",
      "Hope you enjoy viewing them as much as I enjoyed working on them :)"
    ],
    "link": "#main"
  },
  "grabbd": {
    "title": "Grabbd**",
    "type": [
      {
        "paragraph": [
          "Mobile Application",
          "Web Application"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          "Grabbd is a social media application that allows users to explore new venues, recommend favorite locations to friends, and create itineraries for upcoming trips.",
          "Users can participate in a fun community where they can read and post reviews, upload images of the places they have been to, and, most importantly, \"grabb\" places they have loved, liked, or want to try."
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          "At Grabbd, I have worked as a full-stack developer creating RESTful APIs to facilitate the communication between our application, server, and database.",
          "I have also designed and developed a scalable notification and email architecture service through queues and microservices to support a growing user base of 500,000 users.",
          "Additionally, I implemented a B2B Content Management System for the businesses in our application. This tool is a place where companies can manage their content and post offers for users browsing the application.",
          "Through my developer and communication skills, I attained a leadership position. And I am now leading a team of two developers and two quality assurance testers."
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "Swift",
          "Kotlin",
          "React.js",
          "Node.js",
          "Javascript",
          "RabbitMQ",
          "MySQL",
          "Redis",
          "Microservice Architecture",
          "Serverless Architecture",
          "AWS"
        ]
      }
    ],
    "links": [
      { "text": "Website", "link": "https://grabbd.com/" },
      { "text": "iOS", "link": "https://apps.apple.com/us/app/grabbd-grab-share-places-you/id1060585858" },
      { "text": "Android", "link": "https://play.google.com/store/apps/details?id=com.grabbd.app" }
    ],
    "link": "#grabbd"
  },
  "tamm": {
    "title": "Tamm",
    "type": [
      {
        "paragraph": [
          "Web Application"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          "Tamm is a wide-scale project by the Abu Dhabi Digital Authority that seeks to transform and migrate the entirety of the government's 2000 services, spanning 80 governmental entities, with currently over 140 websites and 80 apps, on to a singular e-government platform. Abu Dhabi citizens, residents, businesses, and visitors can apply for multiple services online, interact with customer service, and track the status of their applications."
        ]
      },
      {
        "paragraph": [
          "Tamm provides access to government services such as:",
          "- Payment of utility bills, traffic fines, parking, toll-gates",
          "- Requesting medical appointments and treatments",
          "- Buying housing and property",
          "- Applying for citizenship and residency",
          "- Requesting investment licenses and business opportunities",
          "- Organizing entertainment and events."
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          "At Tamm, I worked with a team to implement 25 individual online services for three different government entities: the Department of Health, the Department of Community Development, and the Social Care and Minors Affairs Foundation. All services were estimated to cut process times by 39%.",
          "Additionally, I led a team of three senior developers, a quality automation engineer, and a business analyst to develop an online dashboard for the Department of Health that integrated with 90+ more services."
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "React.js",
          "Node.js",
          "Typescript",
          "Microservice Architecture"
        ]
      }
    ],
    "links": [
      { "text": "Website", "link": "https://www.tamm.abudhabi/en" }
    ],
    "link": "#tamm"
  },
  "gitex": {
    "title": "GITEX Lego Smart City**",
    "type": [
      {
        "paragraph": [
          "Smart City",
          "Internet of Things"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          "GITEX is one of the biggest technology conferences in the world held in Dubai every year. It displays over 4800 exhibitors from 97+ countries and over 100,000 visitors. During a week, the conference gathers the world’s technology leaders, enterprises, and startups to showcase the future of every business and every industry."
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          "My team member, Shunya Watanabe, and I built a LEGO smart city in under three weeks and exhibited it for five days at GITEX Technology Week.",
          "The LEGO city contained over 15,000 LEGO pieces, 15 Arduino sensors, and 1 Raspberry Pi to demonstrate five data‐driven scenarios:"
        ]
      },
      {
        "paragraph": [
          "- Air quality detection system",
          "A temperature and humidity sensor measured the heat and moisture of the surrounding environment of the LEGO city. Whenever the temperature or the humidity went over a certain threshold, the sensor alerted the CRM system."
        ]
      },
      {
        "paragraph": [
          "- Traffic management system",
          "A computer vision model, trained with multiple photos, measured the number of LEGO cars on the street. We chose to represent traffic congestion with three LEGO cars. Once the camera detected more than this number, the system issued another alert to the CRM system."
        ]
      },
      {
        "paragraph": [
          "- Garbage disposal overflow system",
          "Distance sensors detected the filled percentage of the LEGO garbage disposal. We placed one sensor in the middle and another sensor at the top of the bin. Every time the LEGO garbage blocks reached the top sensor, the CRM system received an alert with a clearing request."
        ]
      },
      {
        "paragraph": [
          "- Smart parking system",
          "Light sensors in the parking lot detected when the LEGO cars had taken up a spot. This action triggered an alert to the CRM system and displayed the taken and available places."
        ]
      },
      {
        "paragraph": [
          "- Train incident detection system",
          "The LEGO city contained a railroad system at its borders. The train that went around the railroad tracks had a distance sensor at the front. Each time the sensor detected an obstacle in front of it, it would automatically stop and trigger another alert to the CRM system. The train would only restart after the obstruction was removed from its way."
        ]
      },
      {
        "paragraph": [
          "All smart city sensors were integrated with the Microsoft Dynamics CRM platform and visualized the real-time values on a screen."
        ]
      },
      {
        "paragraph": [
          "This project was a joint collaboration between PwC and Microsoft."
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "Arduino",
          "Raspberry PI",
          "Node.js",
          "Microsoft Dynamics CRM",
          "LEGO building skills"
        ]
      }
    ],
    "links": [
      { "text": "Website", "link": "https://gitex.com//" }
    ],
    "link": "#gitex"
  },
  "emerge": {
    "title": "EMERGE**",
    "type": [
      {
        "paragraph": [
          "Android Mobile Application",
          "Undergraduate Capstone Project"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          "EMERGE is a mobile content creation and distribution application that enables the diffusion of locally produced content in emerging countries.",
          "By creating a community-driven ecosystem, the goal of my application is to create a platform that gives users an efficient way of generating and accessing relevant information to improve their economic, social, and technological status."
        ]
      }
    ],
    "role": [
      "You can read more about my project in my capstone paper."
    ],
    "technologies": [
      {
        "paragraph": [
          "Android",
          "Linux",
          "Apache",
          "MySQL",
          "Python"
        ]
      }
    ],
    "links": [
      { "text": "Link to Paper", "link": "https://www.arantzardzm.com/documents/emerge.pdf" }
    ],
    "link": "#emerge"
  },
  "maze": {
    "title": "The Maze*",
    "type": [
      {
        "paragraph": [
          "Video Game",
          "First-person Game",
          "Multiplayer Game"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          "The Maze is a 3D multiplayer first-person game where the protagonist is lost on an island and must find a way out of the three mazes to win.",
          "The inspiration for it was the theme of disruption: a situation where a disturbance or a problem interrupts a process. It took me several iterations, but finally, I came up with a concept that resonated with me.",
          "I transformed a one-player game into a multiplayer one. To exit all three mazes, the player must find someone else to help move the main character. There is no way in which one person can complete the game alone."
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          "- Rules",
          "you are lost in an island with three mazes.",
          "your objective is to find a way out of them.",
          "the controllers alone will not work.",
          "you must use other physical inputs to win the game.",
          "do not be afraid to seek help.",
          "good luck!"
        ]
      },
      {
        "paragraph": [
          "- Design",
          "I divided the job into three tasks: designing the level, creating the digital, and creating physical player interactions."
        ]
      },
      {
        "paragraph": [
          "For designing the level, I used Unity’s 3D Game Kit. I imported and distributed walls, gates, cliffs, and gems assets and throughout the environment.",
          "I built the first maze with short walls, no dead ends, and full sunlight. My goal was to help the player get acquainted with the controls. I developed the second maze with taller walls, some dead ends, and little sunlight. By this point, the players should already be familiar with the controls. I created the third and last maze with the tallest walls, several dead ends, and no sunlight. I wanted this to be the most challenging task and bring more players to participate in the experience.",
          "In addition to the maze construction, I added some gems to indicate a correct direction. However, since each maze increases the game difficulty, the last mazes have fewer gems in them."
        ]
      },
      {
        "paragraph": [
          "For the digital player interactions, I wrote and assigned scripts to objects in Unity. I created walking, rotating, and light switch scripts for the first-person player model. I added a script for changing colors for the gem model. And finally, I created a script for dimming lights when the player entered the third maze."
        ]
      },
      {
        "paragraph": [
          "For the physical multiplayer interactions, I used three physical controllers and the Makey Makey kit (a kit that allows a developer to map physical inputs directly to the computer keyboard).",
          "I designed and used the laser cutter to produce two acrylic boxes that served as the buttons that could make a single player rotate left or right and two players to move forward. I also built a third acrylic circular piece that when touched, would turn on a light.",
          "I connected the circuits of the controllers in such a way that two players would need to hold the buttons and hold hands to move forward. I placed the inputs at a far enough distance that a single player could not reach all of them, thus needing another player to play the game."
        ]
      },
      {
        "paragraph": [
          "- Playtesting",
          "When playtesting the game, some players took a while to understand the controls, but others got the hang of it pretty quickly. Overall though, they all understood that to succeed, they had to properly communicate: When should someone rotate? Which direction should one rotate to? When should someone press the light button? Whether the players succeeded in going through all three mazes or simply played the game for two minutes, I could see that everyone was laughing and having a good time. I received a lot of positive feedback with regards to the hand holding. Many enjoyed the connection and the communication needed with someone else to win the game."
        ]
      },
      {
        "paragraph": [
          "- Concluding Thoughts",
          "I enjoyed the fact that I was able to create a digital game that needed some sort of physical interaction between people to be beaten. When I tried it for the first time, ten people were holding hands. Everyone knew that if someone let go, the player would be unable to move forward.",
          "My initial idea was to create a game where the player would find themselves in an isolated environment. Yet, I needed something extra to drive forward the concept of disruption. I am happy that I was able to find a way that I was able to use the concept to make an intended single-player isolated game into a collaborative and communicative multiplayer one. One cannot go through the game alone."
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "Blender",
          "Unity",
          "Arduino Makey Makey",
          "C#"
        ]
      }
    ],
    "iframes": [
      { "link": "https://player.vimeo.com/video/638353759", "width": "500px", "height": "500px" },
      { "link": "https://player.vimeo.com/video/638353729", "width": "500px", "height": "500px" }
    ],
    "link": "#maze"
  },
  "karkhana": {
    "title": "Karkhana*",
    "type": [
      {
          "paragraph": [
            "Educational Website"
          ]
      }
    ],
    "about": [
      {
        "paragraph": [
          "\"Karkhana Innovators’ Club (KIC) is an after-school enrichment program based in Kathmandu, Nepal designed to stimulate creativity, critical thinking, collaboration, risk taking and making skills necessary for innovation. The program is resource-intensive where students experiment with cutting edge technology. KIC is designed to teach concepts from Science, Technology, Engineering, Arts and Mathematics simultaneously.\""
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          "- Objective",
          "As part of our class Making education, my group wanted to focus on the following: how can we improve self directed learning"
        ]
      },
      {
        "paragraph": [
          "- Iterations",
          "As part of our class Making education, my group wanted to focus on the following: how can we improve self directed learning"
        ]
      },
      {
        "paragraph": [
          "- Website"
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "HTML",
          "CSS",
          "Javascript",
          "P5"
        ]
      }
    ],
    "link": "#karkhana"
  },
  "stranded": {
    "title": "Stranded",
    "type": [
      {
        "paragraph": [
          "Interactive Game"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          ""
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          ""
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "Blender",
          "Unity",
          "C#"
        ]
      }
    ],
    "link": "#stranded"
  },
  "square": {
    "title": "Square Escape",
    "type": [
      {
        "paragraph": [
          "Interactive Game"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          ""
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          ""
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "HTML",
          "CSS",
          "Javascript",
          "P5"
        ]
      }
    ],
    "link": "#square"
  },
  "workshop": {
    "title": "3D Blender Workshop",
    "type": [
      {
        "paragraph": [
          "Workshop"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          "Blender is an open source graphics software used for creating animated films, visual effects, generative art, 3D prints, and video games."
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          "I gave an introductory Blender 3D workshop at my university, NYU Abu Dhabi to 20+ students. I wanted to introduce more students to this software :)."
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "Blender"
        ]
      }
    ],
    "links": [
      { "text": "Workshop", "link": "https://github.com/arantzardzm/intro-to-blender-workshop/wiki" }
    ],
    "link": "#workshop"
  },
  "robots": {
    "title": "Revolver (Agnes and George)*",
    "type": [
      {
        "paragraph": [
          "Robot Performance",
          "Generative Art",
          "Textual Art"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          "My classmate, Reine DeFranco, and I conceptualized and built The Revolver (Agnes and George) for our Software Art Text and Performing Robots Classes. It was presented at the end of the semester at New York University Abu Dhabi.",
          "Reine built the robot and I focused on the generative text, audio, and images for the presentation."
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          "My work for the robot performance was split mostly into three parts: text, audio, and image."
        ]
      },
      {
        "paragraph": [
          "- Text",
          "The text used for the project was generated in four steps. First, I wrote two sentences: one related to life and one related to death. Then, I used Wordnik, an online English dictionary, to process the initial sentences I had written and find definitions and phrases for nouns and adjectives. These were written to two different textual databases. Next, I used the Markov Chain generator to create cyclical sentences using sequence probability and databases as input. Finally, I ran the generator several times until I had several paragraphs I could use for my final poem."
        ]
      },
      {
        "paragraph": [
          "- Audio",
          "We decided the robot would not recite any of the lines in the poem. Instead, the audio would serve as a narrative, a reflection of cycles, beginnings and endings, and life as a whole. I used an online text-to-speech website to record the voices of Agnes and George. I wanted to make the poem as real and as human as I possibly could. The poem spoke about religion, love, fear, life, and death, and I needed robots that could feel and show emotion. Using both male and female voices helped. People were able to relate to both sides. In addition to that, I added several voices towards the end. The multiplicity of voices and the increase in movement of the robotic metal balls matched the end of the poem and the state of being dead."
        ]
      },
      {
        "paragraph": [
          "- Image",
          "For the visuals, I used open frameworks and a wall projection. The sketch consisted of blue and yellow circles being drawn over and over again on a fading black background. I tried to match the colors of Agnes to the colors of life. It was very important for me to tell a story with the image, thus I modified variables as the poem progressed. In the final version, circles increase in size and change in color as life moves to death. In the end, all the circles disappear from the screen."
        ]
      },
      {
        "paragraph": [
          "- Poem",
          "A circle, shaped like a plane curve everywhere.",
          "Something, such as a ring, equidistant from a given fixed point: the center.",
          "A circle, a continuous reproduction bounded as life;",
          "The sphere of the present: representing everyday life.",
          "A biography. At infinite. ",
          "Continuing for a lifetime, lifelong, life process.",
          "Continuing without beginning or end; existing outside of time."
        ]
      },
      {
        "paragraph": [
          "Make one’s circle, a source of one’s life.",
          "Especially a person’s life.",
          "Make one’s circle, something till death.",
          "An ageless: personal flame, eternal flame, eternal moonwalk.",
          "Led a good life. Not desperately or urgently.",
          "Ran for the sense of one’s life. Human existing for the life of artist: painted with the beautiful, beautiful sin.",
          "Being without beginning. Specific, characteristic manner of living: lifelong, lifelong.",
          "Related a source of sight. Beginningly beautiful, stunningly endless."
        ]
      },
      {
        "paragraph": [
          "God. Endless God.",
          "I couldn’t remember his name.",
          "Not my life. Someone’s life.",
          "I couldn’t remember his life for dear life.",
          "Absolutely not. Not for any reason whatsoever.",
          "I couldn’t remember his lifetime. For dear life!",
          "A biography. A human existence, the particular course, the circle of life.",
          "Liveliness or vitality that is full circuit in end or existence.",
          "I couldn’t remember his name."
        ]
      },
      {
        "paragraph": [
          "Desperately or urgently, I ran for the characteristic state to regain course.",
          "A person’s living point or end, enclosed at itself.",
          "At surround; enclose. At surround; enclose.",
          "An interruption of the spiritual environment. ",
          "The time between birth and death.",
          "The afterlife. The truths. ",
          "The interval between birth and death.",
          "The continuing point of nature.",
          ",The interval of time between one’s birth and the present.",
          "She led a good, long life.",
          "She can’t remember his name."
        ]
      },
      {
        "paragraph": [
          "The act of dying: The heroine’s death",
          "A planar region bounded by a circle. A vicious circle. A circle gainer.",
          "The act of dying: The process that finishes at its starting point.",
          "Fleeting glimpse, fleeting friendships, fleeting opportunities.",
          "The act of dying: the termination and the extinction.",
          "Fleeting continuously represented as a ring.",
          "A circle, circle, circle."
        ]
      },
      {
        "paragraph": [
          "Passing.",
          "Be the death’s door near death.",
          "Be the center. A circle around.",
          "The destroyer of life. The circle of life.",
          "Move in a circle. A full circle.",
          "To die, to death.",
          "Death of him. Wrongful death of him.",
          "Be the cause of being dead.",
          "The extinction. The extinction of life.",
          "The act of dying.",
          "The state of being dead."
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "Python",
          "openFrameworks",
          "C++"
        ]
      }
    ],
    "iframes": [
      { "link": "https://player.vimeo.com/video/641058159", "width": "500px", "height": "500px" }
    ],
    "link": "#robots"
  },
  "sphere": {
    "title": "Sphere",
    "type": [
      {
        "paragraph": [
          "Generative Art"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          "The Sphere is a generative art piece. It seeks to explore the relationship between rotations, color, shapes, and stories."
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          "- Story",
          "The story I’m trying to visually describe with The Sphere is a simple one: the transition of order into chaos. The art piece begins with small white cubes forming a controlled sphere that suddenly grows into a colorful mix of disorder and confusion. The important thing to understand about the art work is that both states and their transitions are equally beautiful."
        ]
      },
      {
        "paragraph": [
          "- Technique",
          "The Sphere is formed by a series of cubes rotating around each other. This technique is achieved with a series of for loops that allow the cubes to rotate on the plane’s x-axis, y-axis, and z-axis. However, in addition to rotating on the plane, the cubes are also capable of rotating within themselves. Both types of rotations allow the emergence of a sphere. I intentionally used cubes to form the sphere because I wanted to show the ability certain shapes have to construct other shapes.",
          "Besides rotations, The Sphere has also three important story components: distance, size, and color.",
          "The distance between cubes allowed me to move the story forward by taking the viewer’s position into a completely different location. The story begins with the viewer outside of the sphere looking in. However as the cubes begin to drift apart, the user is able to enter the sphere and is able to find him/herself in a completely new world that wouldn’t have been posible before.",
          "The size of the cubes also contributed to the overall mood. The story begins with small delicate cubes that transform into big chaotic ones in the middle that then disappear into nothingness in the end.",
          "The color of the cubes is also important in the transition of the story. The cubes initially are drawn completely in white, and as the story progresses they change color. I chose a palette of blues and greens because I equated a sphere with nature and the planet Earth and I wanted it to be as close to that as possible."
        ]
      },
      {
        "paragraph": [
          "- Concluding Thoughts",
          "The Sphere took me an incredibly long time to record. I had so many variables and so many ideas that I was unable to choose a specific storyline. I recorded multiple videos showing different perspectives of the cubes, the lines, the rotations, the colors, the sizes, and the expansions. They all have the same train of thought, but unique processes, and diverse endings.",
          "If I could change a couple of things it would be having smoother transitions in the colors appearing and the increasing/decreasing of number of circles."
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "openFrameworks",
          "C++"
        ]
      }
    ],
    "iframes": [
      { "link": "https://player.vimeo.com/video/288946104", "width": "500px", "height": "500px" },
      { "link": "https://www.youtube-nocookie.com/embed/Lx3uQn1_lBc", "width": "500px", "height": "500px" }
    ],
    "link": "#sphere"
  },
  "colors": {
    "title": "Colors of Emotion",
    "type": [
      {
        "paragraph": [
          "Generative art"
        ]
      }
    ],
    "about": [
      {
        "paragraph": [
          "The Colors of Emotion is a generative art piece, which draws inspiration from the Recode Project."
        ]
      }
    ],
    "role": [
      {
        "paragraph": [
          "The Colors of Emotion is made up of squares and rectangles drawn across four different screens with randomness as a key characteristic and uniting component. The distinct color ranges encountered in each one of them has the purpose of conveying a specific emotion.",
          "I used some rules during the writing of the code for the creation of the images:"
        ]
      },
      {
        "paragraph": [
          "1. Stay within a specific range of colors",
          "2. Use less fill and stronger line width for vivid emotions",
          "3. Use more fill and weak line with for passive emotions",
          "4. No white spaces"
        ]
      },
      {
        "paragraph": [
          "The first piece, Passion, has a range of colors between red and orange. In many cultures, red is considered to be representative of passion or anger. I decided to represent the first one by using light orange and green colors, instead of dark black ones. This image has the least amount of filled squares and largest amount of sharper corners. That and the vivid colors definitely make it stand out more than the rest."
        ]
      },
      {
        "paragraph": [
          "The second piece, Sadness, has a range of colors between blue and purple with a couple of squares with yellow tones, standing out against the dark background. Blue is consider to represent nostalgia and sadness. I believe the increased fill in the squares and decreased thinness in the edges give the artwork more dimension and more strength."
        ]
      },
      {
        "paragraph": [
          "The third piece, Hope, has a color range between green and blue. This artwork does not stand out as much as the past two. Instead of displaying harsh colors, it displays softer tones. This is a peaceful work with a lot of fills and blended squares with the purpose of creating a soothing sensation for the person who views the piece."
        ]
      },
      {
        "paragraph": [
          "The fourth piece, Love, is filled with orange and pink tones. It is less aggressive than Passion and Sadness, but still a little more vivid than Hope. The pink squares almost blend in with each other and the screen. In addition to the blending, the width of the lines are also thinner and smoother. This combination really forms a softer piece which is more representative of the love emotion."
        ]
      }
    ],
    "technologies": [
      {
        "paragraph": [
          "openFrameworks",
          "C++"
        ]
      }
    ],
    "iframes": [
      { "link": "https://player.vimeo.com/video/288945094", "width": "500px", "height": "500px" },
      { "link": "https://player.vimeo.com/video/288944828", "width": "500px", "height": "500px" }
    ],
    "links": [
      { "text": "Recode Project", "link": "http://recodeproject.com/artwork/v1n2random-squares" }
    ],
    "link": "#colors"
  }
}
